[
    {
        "artist": "A Tribe Called Quest",
        "bio": "Without question the most intelligent, artistic rap group during the 1990s, A Tribe Called Quest jump-started and perfected the hip-hop alternative to hardcore and gangsta rap. In essence, they abandoned the macho posturing rap music had been constructed upon, and focused instead on abstract philosophy and message tracks. The 'sucka MC'' theme had never been completely ignored in hip-hop, but Tribe confronted numerous black issues -- date rape, use of the word nigger, the trials and tribulations of the rap industry -- all of which overpowered the occasional game of the dozens. Just as powerful musically, Quest built upon De La Soul's jazz-rap revolution, basing tracks around laid-back samples instead of the played-out James Brown-fests which many rappers had made a cottage industry by the late '80s. Comprised of Q-Tip, Ali Shaheed Muhammad, and Phife, A Tribe Called Quest debuted in 1989 and released their debut album one year later. Second album The Low End Theory was, quite simply, the most consistent and flowing hip-hop album ever recorded, though the trio moved closer to their harder contemporaries on 1993's Midnight Marauders. A spot on the 1994 Lollapalooza Tour showed their influence with the alternative crowd -- always a bedrock of A Tribe Called Quest's support -- but the group kept it real on 1996's Beats, Rhymes and Life, a dedication to the streets and the hip-hop underground.",
        "artistPic": "http://www.xxlmag.com/wp-content/uploads/2011/09/A-Tribe-Called-Quest.jpg",
        "genre": "Hip-Hop",
        "albums": {
            "albumName": "Peoples' Instinctive Travels & the Paths of Rhythm",
            "cover": "http://images.emusic.com/music/images/album/114/785/11478587/600x600.jpg",
            "trackTitles":
                        [
                            "Push It Along",
                            "Luck Of Lucien",
                            "After Hours",
                            "Footprints",
                            "I Left My Wallet In El Segundo",
                            "Pubic Enemy",
                            "Bonita Applebum",
                            "Can I Kick It?",
                            "Youthful Expression",
                            "Rhythm (Devote To The Art Of Moving Butts)",
                            "Mr. Muhammad",
                            "Ham 'N' Eggs",
                            "Go Ahead In The Rain",
                            "Description Of A Fool"
                        ],
            "source":
                [
                    "alexmlewis.com/school/n222/songs/a_tribe_called_quest/peoples_instinctive_travels/1_push_it_along.mp3",
                    "alexmlewis.com/school/n222/songs/a_tribe_called_quest/peoples_instinctive_travels/2_luck_of_lucien.mp3",
                    "alexmlewis.com/school/n222/songs/a_tribe_called_quest/peoples_instinctive_travels/3_after_hours.mp3",
                    "alexmlewis.com/school/n222/songs/a_tribe_called_quest/peoples_instinctive_travels/4_footprints.mp3",
                    "alexmlewis.com/school/n222/songs/a_tribe_called_quest/peoples_instinctive_travels/5_i_left_my_wallet_in_el_segundo.mp3",
                    "alexmlewis.com/school/n222/songs/a_tribe_called_quest/peoples_instinctive_travels/6_pubic_enemy.mp3",
                    "alexmlewis.com/school/n222/songs/a_tribe_called_quest/peoples_instinctive_travels/7_bonita_applebum.mp3",
                    "alexmlewis.com/school/n222/songs/a_tribe_called_quest/peoples_instinctive_travels/8_can_I_kick_it.mp3",
                    "alexmlewis.com/school/n222/songs/a_tribe_called_quest/peoples_instinctive_travels/9_youthful_expression.mp3",
                    "alexmlewis.com/school/n222/songs/a_tribe_called_quest/peoples_instinctive_travels/10_rhythm.mp3",
                    "alexmlewis.com/school/n222/songs/a_tribe_called_quest/peoples_instinctive_travels/11_mr_muhammad.mp3",
                    "alexmlewis.com/school/n222/songs/a_tribe_called_quest/peoples_instinctive_travels/12_ham_n_eggs.mp3",
                    "alexmlewis.com/school/n222/songs/a_tribe_called_quest/peoples_instinctive_travels/13_go_ahead_in_the_rain.mp3",
                    "alexmlewis.com/school/n222/songs/a_tribe_called_quest/peoples_instinctive_travels/14_description_of_a_fool.mp3"

                ]
        }
    },
    {
        "artist": "Burial",
        "bio": "Anonymity was part of the initial lure of Burial, a dubstep producer from London. 'I love...old jungle and garage tunes, when you didn't know anything about them, and nothing was between you and the tunes,' Burial was quoted as saying in a rare interview (The Guardian, October 26, 2007). 'I liked the mystery; it was more scary and sexy, the opposite of other music.' Anonymity, of course, has long been a quality positively associated with electronic music, going back to early years of Detroit techno, when acts such as Underground Resistance and Drexciya veiled themselves in obscurity, and even farther back to Kraftwerk, who championed the notion, 'We are the robots.' So it's the back story of Burial (or rather, the lack thereof), in addition to his music, that explains his great appeal to many of those well-versed in the traditions of electronic music.",
        "artistPic": "http://thedankles.com/wp-content/uploads/2013/12/Burial.jpg",
        "genre": "Electronic",
        "albums": {
            "albumName": "South London Boroughs EP",
            "cover": "http://images.emusic.com/music/images/album/109/779/10977951/600x600.jpg",
            "trackTitles":
                        [
                            "South London Boroughs"
                        ],
            "source":
                [
                    "alexmlewis.com/school/n222/songs/burial/south_london/south_london_boroughs.mp3"
                ]
        }
    },
    {
        "artist": "Coldplay",
        "bio": "After surfacing in 2000 with the breakthrough single 'Yellow,' Coldplay quickly became one of the biggest bands of the new millennium, honing a mix of introspective Brit-pop and anthemic rock that landed the British quartet a near-permanent residence on record charts worldwide. The group's emergence was perfectly timed; Radiohead had just released the overly cerebral Kid A, while Oasis had ditched two founding members and embraced psychedelic experimentation on Standing on the Shoulder of Giants. U.K. audiences were hungry for a fresh-faced rock band with big aspirations and an even bigger sound, and Coldplay were more than happy to take the reins. Parachutes went multi-platinum in several countries and earned the band its first Grammy, but Coldplay continued to grow into the 2000s, topping their debut album's success with higher record sales and an increased public profile.",
        "artistPic": "http://fanart.tv/fanart/music/cc197bad-dc9c-440d-a5b5-d52ba2e14234/artistbackground/coldplay-4fc0c69c452a3.jpg",
        "genre": "Pop",
        "albums": {
            "albumName": "Magic",
            "cover": "http://images.emusic.com/music/images/album/148/097/14809781/600x600.jpg",
            "trackTitles":
                        [
                            "Magic"
                        ],
            "source":
                [
                    "alexmlewis.com/school/n222/songs/coldplay/magic/magic.mp3"
                ]
        }
    },
    {
        "artist": "DJ Krush",
        "bio": "Japanese turntablist and producer DJ Krush is one of the few island-nation throw-ups to be embraced by the global hip-hop world. Releasing material through Sony in Japan, Mo'Wax and Virgin in the U.K., and Axiom, Shadow, and A&M in America, Krush's heady brand of experimental, (largely) instrumental hip-hop has been praised by everyone from hardcore underground hip-hop 'zines like The Bomb to the speckless offices of Rolling Stone and Spin. Beginning as a bedroom DJ in the mid-'80s following the Japanese leg of the Wildstyle tour, Krush moved into mobile DJing, backing up rappers, and eventually solo production. Although his Japan-only debut freely mixed elements of R&B and acid jazz with the beefy breakbeat backbone of mid-tempo hip-hop, Krush's work has since tended more toward the abstract, applying heavy effects and sample manipulation to thick, smart breaks, layered, almost ambient textures, and subtle, inventive scratching. Krush came to larger acclaim in the mid-'90s through his association with the London-based Mo'Wax label, which released his Strictly Turntablized in 1994 and Meiso in 1996, both reissued stateside by A&M. While Turntablized is closer to a collection of DJ tools, Meiso is a return of sorts to his earlier work, including rappers such as Guru and CL Smooth on a few tracks and incorporating a wider variety of instrumental sounds and atmospheres. In addition to 1997's Milight, Krush also featured on a number of various-artists collections, including Mo'Wax's celebrated Headz, as well as Altered Beats and Axiom Dub (both out on Bill Laswell's Axiom label). Kakusei appeared on Mo'Wax/Columbia in 1999, followed by the mix albums Code 4109 and Tragicomic the next year. Zen from 2001 was filled with guest MCs while The Message at the Depth from 2003 featured far fewer and focused on instrumentals. Jaku landed in 2004, and two years later the Stepping Stones collection featured Krush remixing highlight from his back catalog.",
        "artistPic": "http://thecommunity.com.au/wp-content/files_flutter/1331266364dxc__xk425058.jpg",
        "genre": "Electronic",
        "albums": {
            "albumName": "Krush",
            "cover": "http://images.emusic.com/music/images/album/108/134/10813483/600x600.jpg",
            "trackTitles":
                         [
                            "I Am 300 Tag",
                             "Keeping The Motion",
                             "Mixed Nuts"
                         ],
            "source":
                [
                    "alexmlewis.com/school/n222/songs/dj_krush/krush/1_am_300_tag.mp3",
                    "alexmlewis.com/school/n222/songs/dj_krush/krush/2_keeping_the_motion.mp3",
                    "alexmlewis.com/school/n222/songs/dj_krush/krush/3_mixed_nuts.mp3"
                ]
        }
    },
    {
        "artist": "DJ Snake",
        "bio": "William Grigahcine, better known by his stage name DJ Snake, is a French DJ and producer mixing hip hop and electronic music. He is a Grammy-nominated producer and artist who debuted into the international scene with singles 'Bird Machine' and 'Turn Down For What' in 2013. Bird Machine is a collaboration with fellow French act, Alesia. The single was picked up by Mad Decent, a Los Angeles based record label run by Diplo, and released in February 2013. In June 2013, DJ Snake was invited by Diplo to do a live mix on his radio show, 'Diplo & Friends', which airs on BBC Radio 1.",
        "artistPic": "http://stoneyroads.com/media/DJ-snake-1024x682.jpg",
        "genre": "Electronic",
        "albums": {
            "albumName": "Turn Down For What",
            "cover": "http://kamp.arizona.edu/files/dj-snake-lil-jon-turn-down-for-what.jpg?1391069914",
            "trackTitles":
                         [
                            "Turn Down For What (Feat. Lil John)"
                         ],
            "source":
                [
                    "alexmlewis.com/school/n222/songs/dj_snake_and_lil_john/turn_down_for_what/turn_down_for_what.mp3"
                ]
        }
    },
    {
        "artist": "Holy Ghost!",
        "bio": "Friends since attending elementary school on the Upper West Side of Manhattan, Alex Frankel and Nick Millhiser were members of Automato, a rap group whose last releases, including a self-titled album released in 2003, were produced by the DFA's James Murphy and Tim Goldsworthy. After Automato dissolved, Murphy and Goldsworthy encouraged Frankel and Millhiser to continue pushing toward dance music. Push they did; Frankel and Millhiser co-produced the warm and melodic Hold On with the DFA -- settling on the Bar-Kays-referencing Holy Ghost! just prior to the vinyl pressing stage -- and released it on the DFA label in October 2007. 'I Will Come Back', their second single, didnt come out until 2009 but made an impact with its video -- a remake of the indelible clip for New Order's Confusion, a snapshot of New Yorks clubbing scene (with producer Arthur Baker reprising his role). The four-track Static on the Wire EP followed in 2010, continuing the duos uncanny ability to evoke the colorful, layered sound of early- to mid-80s club music. In 2011, Holy Ghost! released a self-titled album that included some of their previously released songs, as well as a guest appearance from the Michael McDonald on the closing 'Some Children'. By that point, Holy Ghost! had also become one of the more prolific remix teams; they had re-worked (in some cases technically covering) tracks by MGMT, Moby, Cut Copy, Phoenix, the Juan MacLean, and Murphy's LCD Soundsystem. Their second album, Dynamics, was released on DFA in 2013.",
        "artistPic": "http://www.esquire.com/cm/esquire/images/UJ/esq-holy-ghost-040111-lg.jpg",
        "genre": "Electronic",
        "albums": {
            "albumName": "Hold On",
            "cover": "http://images.emusic.com/music/images/album/113/734/11373424/600x600.jpg",
            "trackTitles":
                         [
                            "Hold On"
                         ],
            "source":
                [
                    "alexmlewis.com/school/n222/songs/holy_ghost/hold_on/hold_on.mp3"
                ]
        }
    },
    {
        "artist": "Kurt Vile",
        "bio": "Philadelphia songwriter Kurt Vile was already recording himself at home by age 14, shortly after his bluegrass-loving father purchased him a banjo to encourage his youthful creativity. By age 17, Vile was self-releasing cassettes of his home recordings, which in the earliest days were strongly influenced by the raw slacker pop of the Drag City roster. He would continue to record prolifically, releasing cassettes and CD-Rs of his solo material while holding down a day job as a forklift operator.",
        "artistPic": "http://matablog.matadorrecords.com/wp-content/uploads/2009/09/kurt_vile_big_ass_lens.jpg",
        "genre": "Rock",
        "albums": {
            "albumName": "God Is Saying This To You",
            "cover": "http://images.emusic.com/music/images/album/113/962/11396249/600x600.jpg",
            "trackTitles":
                         [
                            "God Is Saying This To You",
                             "My Sympathy",
                             "Red Apples",
                             "Beach On The Moon (Recycled Lyrics)",
                             "Can't Come",
                             "Overnight KV",
                             "Prom King",
                             "My Best Friends (Don't Even Pass This)",
                             "White Riffs",
                             "Songs For John In D",
                             "Doctor Orgatron",
                             "Frip Job"
                         ],
            "source":
                [
                    "alexmlewis.com/school/n222/songs/kurt_vile/god_is_saying_this_to_you/1_god_is_saying_this_to_you.mp3",
                    "alexmlewis.com/school/n222/songs/kurt_vile/god_is_saying_this_to_you/2_my_sympathy.mp3",
                    "alexmlewis.com/school/n222/songs/kurt_vile/god_is_saying_this_to_you/3_red_apples",
                    "alexmlewis.com/school/n222/songs/kurt_vile/god_is_saying_this_to_you/4_beach_on_the_moon.mp3",
                    "alexmlewis.com/school/n222/songs/kurt_vile/god_is_saying_this_to_you/5_cant_come.mp3",
                    "alexmlewis.com/school/n222/songs/kurt_vile/god_is_saying_this_to_you/6_overnight_kv.mp3",
                    "alexmlewis.com/school/n222/songs/kurt_vile/god_is_saying_this_to_you/7_prom_king.mp3",
                    "alexmlewis.com/school/n222/songs/kurt_vile/god_is_saying_this_to_you/8_my_best_friend.mp3",
                    "alexmlewis.com/school/n222/songs/kurt_vile/god_is_saying_this_to_you/9_white_riffs.mp3",
                    "alexmlewis.com/school/n222/songs/kurt_vile/god_is_saying_this_to_you/10_songs_for_john_in_d.mp3",
                    "alexmlewis.com/school/n222/songs/kurt_vile/god_is_saying_this_to_you/11_doctor_orgatron.mp3",
                    "alexmlewis.com/school/n222/songs/kurt_vile/god_is_saying_this_to_you/12_frip_job.mp3"
                ]
        }
    },
    {
        "artist": "Parquet Courts",
        "bio": "Parquet Courts are an American punk rock band based in Brooklyn, New York, that formed in late 2010. The band consists of Andrew Savage (lead vocals, guitar), Austin Brown (guitar), Sean Yeaton (bass), and Max Savage (drums). The band released their debut album, American Specialties, on a limited cassette release (later released on LP by Play Pinball! Records). This was followed by the full length album, Light Up Gold (2012), which was initially released on Savage's Dull Tools label and later reissued on What's Your Rupture? in 2013. Light Up Gold received acclaim in both the DIY underground and mainstream rock press.",
        "artistPic": "http://www.rollogrady.com/wp-content/uploads/2013/03/parquet-courts.jpg",
        "genre": "Rock",
        "albums": {
            "albumName": "Tally All The Things That You Broke",
            "cover": "http://images.emusic.com/music/images/album/144/392/14439253/600x600.jpg",
            "trackTitles":
                         [
                            "You've Got Me Wonderin' Now",
                             "Descend (The Way)",
                             "The More It Works",
                             "Fall On Yr Face",
                             "He's Seeing Path"
                         ],
            "source":
                [
                    "alexmlewis.com/school/n222/songs/parquet_courts/tally_all_the_things_that_you_broke/1_youve_got_me_wonderin_now.mp3",
                    "alexmlewis.com/school/n222/songs/parquet_courts/tally_all_the_things_that_you_broke/2_descend.mp3",
                    "alexmlewis.com/school/n222/songs/parquet_courts/tally_all_the_things_that_you_broke/3_the_more_it_works.mp3",
                    "alexmlewis.com/school/n222/songs/parquet_courts/tally_all_the_things_that_you_broke/4_fall_on_yr_face.mp3",
                    "alexmlewis.com/school/n222/songs/parquet_courts/tally_all_the_things_that_you_broke/5_hes_seeing_path.mp3"
                ]
        }
    },
    {
        "artist": "The Black Keys",
        "bio": "Its too facile to call the Black Keys counterparts of the White Stripes: they share several surface similarities -- their names are color-coded, they hail from the Midwest, theyre guitar-and-drum blues-rock duos -- but the Black Keys are their own distinct thing, a tougher, rougher rock band with a purist streak that never surfaces in the Stripes. But thats not to say that the Black Keys are blues traditionalists: even on their 2002 debut, The Big Come Up, they covered the Beatles psychedelic classic She Said She Said, indicating a fascination with sound and texture that would later take hold on such latter-day albums as 2008s Attack & Release, where guitarist Dan Auerbach and drummer Patrick Carney teamed up with sonic architect Danger Mouse. In between those two records, the duo established the Black Keys as a rock & roll band with a brutal, primal force, and songwriters of considerable depth, as evidenced on such fine albums as 2003s Thickfreakness and 2004s Rubber Factory.",
        "artistPic": "http://art.ngfiles.com/images/56/mxthod_the-black-keys-sketch.png",
        "genre": "Rock",
        "albums": {
            "albumName": "The Big Come Up",
            "cover": "http://images.emusic.com/music/images/album/117/189/11718929/600x600.jpg",
            "trackTitles":
                         [
                            "Busted",
                             "Do The Rump"
                         ],
            "source":
                [
                    "alexmlewis.com/school/n222/songs/the_black_keys/the_big_come_up/1_busted.mp3",
                    "alexmlewis.com/school/n222/songs/the_black_keys/the_big_come_up/2_do_the_rump.mp3"
                ]
        }
    }


]